privacy/app/Http/Controllers/HomeController.php

select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
select `users`.`name` from `users` where `users`.`kode_company` = '02'
---
    public function index()
    {
        $lokasi = auth()->user()->kode_lokasi;
        $company = auth()->user()->kode_company;

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');

        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
        $nama_company = $get_company->nama_company;

        $level = auth()->user()->level;
        $nama_user = auth()->user()->username;

        $user_login = User::join('sessions', 'users.id', '=', 'sessions.user_id')
                ->get();
        $leng4 = $user_login->count();

        $user_login2 = User::select('users.name')
                ->where('users.kode_company',auth()->user()->kode_company)
                ->get();