privacy/app/Http/Controllers/MembershipController.php

select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
select `nama_company`, `kode_company` from `company`
---
    public function index()
    {
        $create_url = route('membership.create');
        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
        $nama_company = $get_company->nama_company;

        $Company = Company::pluck('nama_company','kode_company');